tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18346_tdd.h
#define CWG1DBF_DBF2                  1091
#define CWG1DBF2                      1092
#define CWG1DBF3                      1093
#define CWG1DBF_DBF3                  1094
#define CWG1DBF_DBF4                  1095
#define CWG1DBF4                      1096
#define CWG1DBF_DBF5                  1097
#define CWG1DBF5                      1098
#define CWG1CON0                      1099
#define CWG1MODE0                     1100
#define CWG1CON0_MODE                 1101
#define CWG1CON0_MODE0                1102
#define CWG1MODE                      1103
#define CWG1MODE1                     1104
#define CWG1CON0_MODE1                1105
#define CWG1MODE2                     1106
#define CWG1CON0_MODE2                1107
#define CWG1CON0_LD                   1108
#define CWG1LD                        1109
#define CWG1EN                        1110
#define G1EN                          1111
#define CWG1CON0_EN                   1112
#define CWG1CON1                      1113
#define CWG1POLA                      1114
#define CWG1CON1_POLA                 1115
#define CWG1CON1_POLB                 1116
#define CWG1POLB                      1117
#define CWG1POLC                      1118
#define CWG1CON1_POLC                 1119
#define CWG1CON1_POLD                 1120
#define CWG1POLD                      1121
#define CWG1CON1_IN                   1122
#define CWG1IN                        1123
#define CWG1AS0                       1124
#define CWG1LSAC                      1125
#define CWG1AS0_LSAC0                 1126
#define CWG1AS0_LSAC                  1127
#define CWG1LSAC0                     1128
#define CWG1AS0_LSAC1                 1129
#define CWG1LSAC1                     1130
#define CWG1AS0_LSBD0                 1131
#define CWG1LSBD0                     1132
#define CWG1LSBD                      1133
#define CWG1AS0_LSBD                  1134
#define CWG1LSBD1                     1135
#define CWG1AS0_LSBD1                 1136
#define CWG1AS0_REN                   1137
#define CWG1REN                       1138
#define CWG1AS0_SHUTDOWN              1139
#define CWG1SHUTDOWN                  1140
#define CWG1AS1                       1141
#define CWG1AS1_AS0E                  1142
#define CWG1AS1_AS1E                  1143
#define CWG1AS1_AS2E                  1144
#define CWG1AS1_AS3E                  1145
#define CWG1AS1_AS4E                  1146
#define CWG1STR                       1147
#define CWG1STRA                      1148
#define CWG1STR_STRA                  1149
#define CWG1STRB                      1150
#define CWG1STR_STRB                  1151
#define CWG1STRC                      1152
#define CWG1STR_STRC                  1153
#define CWG1STR_STRD                  1154
#define CWG1STRD                      1155
#define CWG1OVRA                      1156
#define CWG1STR_OVRA                  1157
#define CWG1OVRB                      1158
#define CWG1STR_OVRB                  1159
#define CWG1OVRC                      1160
#define CWG1STR_OVRC                  1161
#define CWG1OVRD                      1162
#define CWG1STR_OVRD                  1163
#define CWG2CLKCON                    1164
#define CWG2CS                        1165
#define CWG2CLKCON_CS                 1166
#define CWG2DAT                       1167
#define CWG2DAT0                      1168
#define CWG2DAT_DAT                   1169
#define CWG2DAT1                      1170
#define CWG2DAT2                      1171
#define CWG2DAT3                      1172
#define CWG2DBR_DBR                   1173
#define CWG2DBR_DBR0                  1174
#define CWG2DBR                       1175
#define CWG2DBR0                      1176
#define CWG2DBR_DBR1                  1177
#define CWG2DBR1                      1178
#define CWG2DBR_DBR2                  1179
#define CWG2DBR2                      1180
#define CWG2DBR_DBR3                  1181
#define CWG2DBR3                      1182
#define CWG2DBR_DBR4                  1183
#define CWG2DBR4                      1184
#define CWG2DBR_DBR5                  1185
#define CWG2DBR5                      1186
#define CWG2DBF                       1187
#define CWG2DBF_DBF0                  1188
#define CWG2DBF_DBF                   1189
#define CWG2DBF0                      1190
#define CWG2DBF_DBF1                  1191
#define CWG2DBF1                      1192
#define CWG2DBF_DBF2                  1193
#define CWG2DBF2                      1194
#define CWG2DBF_DBF3                  1195
#define CWG2DBF3                      1196
#define CWG2DBF_DBF4                  1197
#define CWG2DBF4                      1198
#define CWG2DBF5                      1199
#define CWG2DBF_DBF5                  1200
#define CWG2CON0                      1201
#define CWG2MODE                      1202
#define CWG2MODE0                     1203
#define CWG2CON0_MODE                 1204
#define CWG2CON0_MODE0                1205
#define CWG2MODE1                     1206
#define CWG2CON0_MODE1                1207
#define CWG2MODE2                     1208
#define CWG2CON0_MODE2                1209
#define CWG2LD                        1210
#define CWG2CON0_LD                   1211
#define CWG2CON0_EN                   1212
#define CWG2EN                        1213
#define G2EN                          1214
#define CWG2CON1                      1215
#define CWG2POLA                      1216
#define CWG2CON1_POLA                 1217
#define CWG2POLB                      1218
#define CWG2CON1_POLB                 1219
#define CWG2POLC                      1220
#define CWG2CON1_POLC                 1221
#define CWG2CON1_POLD                 1222
#define CWG2POLD                      1223
#define CWG2IN                        1224
#define CWG2CON1_IN                   1225
#define CWG2AS0                       1226
#define CWG2LSAC                      1227
#define CWG2AS0_LSAC                  1228
#define CWG2LSAC0                     1229
#define CWG2AS0_LSAC0                 1230
#define CWG2LSAC1                     1231
#define CWG2AS0_LSAC1                 1232
#define CWG2AS0_LSBD0                 1233
#define CWG2LSBD                      1234
#define CWG2AS0_LSBD                  1235
#define CWG2LSBD0                     1236
#define CWG2AS0_LSBD1                 1237
#define CWG2LSBD1                     1238
#define CWG2AS0_REN                   1239
#define CWG2REN                       1240
#define CWG2AS0_SHUTDOWN              1241
#define CWG2SHUTDOWN                  1242
#define CWG2AS1                       1243
#define CWG2AS1_AS0E                  1244
#define CWG2AS1_AS1E                  1245
#define CWG2AS1_AS2E                  1246
#define CWG2AS1_AS3E                  1247
#define CWG2AS1_AS4E                  1248
#define CWG2STR                       1249
#define CWG2STR_STRA                  1250
#define CWG2STRA                      1251
#define CWG2STR_STRB                  1252
#define CWG2STRB                      1253
#define CWG2STR_STRC                  1254
#define CWG2STRC                      1255
#define CWG2STR_STRD                  1256
#define CWG2STRD                      1257
#define CWG2STR_OVRA                  1258
#define CWG2OVRA                      1259
#define CWG2OVRB                      1260
#define CWG2STR_OVRB                  1261
#define CWG2STR_OVRC                  1262
#define CWG2OVRC                      1263
#define CWG2OVRD                      1264
#define CWG2STR_OVRD                  1265
#define NVMADR0                       1266
#define NVMADRL                       1267
#define NVMADR1                       1268
#define NVMADR2                       1269
#define NVMADR3                       1270
#define NVMADR4                       1271
#define NVMADR5                       1272
#define NVMADR6                       1273
#define NVMADR7                       1274
#define NVMADR8                       1275
#define NVMADRH                       1276
#define NVMADR9                       1277
#define NVMADR10                      1278
#define NVMADR11                      1279
#define NVMADR12                      1280
#define NVMADR13                      1281
#define NVMADR14                      1282
#define NVMDAT0                       1283
#define NVMDATL                       1284
#define NVMDAT1                       1285
#define NVMDAT2                       1286
#define NVMDAT3                       1287
#define NVMDAT4                       1288
#define NVMDAT5                       1289
#define NVMDAT6                       1290
#define NVMDAT7                       1291
#define NVMDAT8                       1292
#define NVMDATH                       1293
#define NVMDAT9                       1294
#define NVMDAT10                      1295
#define NVMDAT11                      1296
#define NVMDAT12                      1297
#define NVMDAT13                      1298
#define NVMCON1                       1299
#define RD                            1300
#define WR                            1301
#define WREN                          1302
#define WRERR                         1303
#define FREE                          1304
#define LWLO                          1305
#define NVMREGS                       1306
#define NVMCON2                       1307
#define NMVCON2                       1308
#define PCON0                         1309
#define nBOR                          1310
#define nPOR                          1311
#define nRI                           1312
#define nRMCLR                        1313
#define nRWDT                         1314
#define STKUNF                        1315
#define STKOVF                        1316
#define PMD0                          1317
#define IOCMD                         1318
#define CLKRMD                        1319
#define NVMMD                         1320
#define FVRMD                         1321
#define SYSCMD                        1322
#define PMD1                          1323
#define TMR0MD                        1324
#define TMR1MD                        1325
#define TMR2MD                        1326
#define TMR3MD                        1327
#define TMR4MD                        1328
#define TMR5MD                        1329
#define TMR6MD                        1330
#define NCOMD                         1331
#define PMD2                          1332
#define CMP1MD                        1333
#define CMP2MD                        1334
#define ADCMD                         1335
#define DACMD                         1336
#define PMD3                          1337
#define CCP1MD                        1338
#define CCP2MD                        1339
#define CCP3MD                        1340
#define CCP4MD                        1341
#define PWM5MD                        1342
#define PWM6MD                        1343
#define CWG1MD                        1344
#define CWG2MD                        1345
#define PMD4                          1346
#define MSSP1MD                       1347
#define MSSP2MD                       1348
#define UART1MD                       1349
#define PMD5                          1350
#define DSMMD                         1351
#define CLC1MD                        1352
#define CLC2MD                        1353
#define CLC3MD                        1354
#define CLC4MD                        1355
#define CPUDOZE                       1356
#define DOZE0                         1357
#define DOZE                          1358
#define DOZE1                         1359
#define DOZE2                         1360
#define DOE                           1361
#define ROI                           1362
#define DOZEN                         1363
#define IDLEN                         1364
#define OSCCON1                       1365
#define NDIV0                         1366
#define NDIV                          1367
#define NDIV1                         1368
#define NDIV2                         1369
#define NDIV3                         1370
#define NOSC0                         1371
#define NOSC                          1372
#define NOSC1                         1373
#define NOSC2                         1374
#define OSCCON2                       1375
#define CDIV0                         1376
#define CDIV                          1377
#define CDIV1                         1378
#define CDIV2                         1379
#define CDIV3                         1380
#define COSC                          1381
#define COSC0                         1382
#define COSC1                         1383
#define COSC2                         1384
#define OSCCON3                       1385
#define NOSCR                         1386
#define ORDY                          1387
#define SOSCBE                        1388
#define SOSCPWR                       1389
#define CSWHOLD                       1390
#define OSCSTAT1                      1391
#define PLLR                          1392
#define ADOR                          1393
#define SOR                           1394
#define LFOR                          1395
#define HFOR                          1396
#define EXTOR                         1397
#define OSCEN                         1398
#define ADOEN                         1399
#define SOSCEN                        1400
#define LFOEN                         1401
#define HFOEN                         1402
#define EXTOEN                        1403
#define OSCTUNE                       1404
#define HFTUN0                        1405
#define HFTUN                         1406
#define HFTUN1                        1407
#define HFTUN2                        1408
#define HFTUN3                        1409
#define HFTUN4                        1410
#define HFTUN5                        1411
#define OSCFRQ                        1412
#define HFFRQ                         1413
#define HFFRQ0                        1414
#define HFFRQ1                        1415
#define HFFRQ2                        1416
#define HFFRQ3                        1417
#define PPSLOCK                       1418
#define PPSLOCKED                     1419
#define INTPPS0                       1420
#define INTPPS                        1421
#define INTPPS1                       1422
#define INTPPS2                       1423
#define INTPPS3                       1424
#define INTPPS4                       1425
#define T0CKIPPS0                     1426
#define T0CKIPPS                      1427
#define T0CKIPPS1                     1428
#define T0CKIPPS2                     1429
#define T0CKIPPS3                     1430
#define T0CKIPPS4                     1431
#define T1CKIPPS0                     1432
#define T1CKIPPS                      1433
#define T1CKIPPS1                     1434
#define T1CKIPPS2                     1435
#define T1CKIPPS3                     1436
#define T1CKIPPS4                     1437
#define T1GPPS0                       1438
#define T1GPPS                        1439
#define T1GPPS1                       1440
#define T1GPPS2                       1441
#define T1GPPS3                       1442
#define T1GPPS4                       1443
#define CCP1PPS0                      1444
#define CCP1PPS                       1445
#define CCP1PPS1                      1446
#define CCP1PPS2                      1447
#define CCP1PPS3                      1448
#define CCP1PPS4                      1449
#define CCP2PPS0                      1450
#define CCP2PPS                       1451
#define CCP2PPS1                      1452
#define CCP2PPS2                      1453
#define CCP2PPS3                      1454
#define CCP2PPS4                      1455
#define CCP3PPS0                      1456
#define CCP3PPS                       1457
#define CCP3PPS1                      1458
#define CCP3PPS2                      1459
#define CCP3PPS3                      1460
#define CCP3PPS4                      1461
#define CCP4PPS0                      1462
#define CCP4PPS                       1463
#define CCP4PPS1                      1464
#define CCP4PPS2                      1465
#define CCP4PPS3                      1466
#define CCP4PPS4                      1467
#define CWG1PPS0                      1468
#define CWG1PPS                       1469
#define CWG1PPS1                      1470
#define CWG1PPS2                      1471
#define CWG1PPS3                      1472
#define CWG1PPS4                      1473
#define CWG2PPS0                      1474
#define CWG2PPS                       1475
#define CWG2PPS1                      1476
#define CWG2PPS2                      1477
#define CWG2PPS3                      1478
#define CWG2PPS4                      1479
#define MDCIN1PPS                     1480
#define MDCIN1PPS0                    1481
#define MDCIN1PPS1                    1482
#define MDCIN1PPS2                    1483
#define MDCIN1PPS3                    1484
#define MDCIN1PPS4                    1485
#define MDCIN2PPS0                    1486
#define MDCIN2PPS                     1487
#define MDCIN2PPS1                    1488
#define MDCIN2PPS2                    1489
#define MDCIN2PPS3                    1490
#define MDCIN2PPS4                    1491
#define MDMINPPS                      1492
#define MDMINPPS0                     1493
#define MDMINPPS1                     1494
#define MDMINPPS2                     1495
#define MDMINPPS3                     1496
#define MDMINPPS4                     1497
#define SSP2CLKPPS                    1498
#define SSP2CLKPPS0                   1499
#define SSP2CLKPPS1                   1500
#define SSP2CLKPPS2                   1501
#define SSP2CLKPPS3                   1502
#define SSP2CLKPPS4                   1503
#define SSP2DATPPS                    1504
#define SSP2DATPPS0                   1505
#define SSP2DATPPS1                   1506
#define SSP2DATPPS2                   1507
#define SSP2DATPPS3                   1508
#define SSP2DATPPS4                   1509
#define SSP2SSPPS                     1510
#define SSP2SSPPS0                    1511
#define SSP2SSPPS1                    1512
#define SSP2SSPPS2                    1513
#define SSP2SSPPS3                    1514
#define SSP2SSPPS4                    1515
#define SSP1CLKPPS0                   1516
#define SSP1CLKPPS                    1517
#define SSP1CLKPPS1                   1518
#define SSP1CLKPPS2                   1519
#define SSP1CLKPPS3                   1520
#define SSP1CLKPPS4                   1521
#define SSP1DATPPS0                   1522
#define SSP1DATPPS                    1523
#define SSP1DATPPS1                   1524
#define SSP1DATPPS2                   1525
#define SSP1DATPPS3                   1526
#define SSP1DATPPS4                   1527
#define SSP1SSPPS                     1528
#define SSP1SSPPS0                    1529
#define SSP1SSPPS1                    1530
#define SSP1SSPPS2                    1531
#define SSP1SSPPS3                    1532
#define SSP1SSPPS4                    1533
#define RXPPS                         1534
#define RXDTPPS0                      1535
#define RXDTPPS1                      1536
#define RXDTPPS2                      1537
#define RXDTPPS3                      1538
#define RXDTPPS4                      1539
#define TXCKPPS0                      1540
#define TXPPS                         1541
#define TXCKPPS1                      1542
#define TXCKPPS2                      1543
#define TXCKPPS3                      1544
#define TXCKPPS4                      1545
#define CLCIN0PPS                     1546
#define CLCIN0PPS0                    1547
#define CLCIN0PPS1                    1548
#define CLCIN0PPS2                    1549
#define CLCIN0PPS3                    1550
#define CLCIN0PPS4                    1551
#define CLCIN1PPS0                    1552
#define CLCIN1PPS                     1553
#define CLCIN1PPS1                    1554
#define CLCIN1PPS2                    1555
#define CLCIN1PPS3                    1556
#define CLCIN1PPS4                    1557
#define CLCIN2PPS                     1558
#define CLCIN2PPS0                    1559
#define CLCIN2PPS1                    1560
#define CLCIN2PPS2                    1561
#define CLCIN2PPS3                    1562
#define CLCIN2PPS4                    1563
#define CLCIN3PPS                     1564
#define CLCIN3PPS0                    1565
#define CLCIN3PPS1                    1566
#define CLCIN3PPS2                    1567
#define CLCIN3PPS3                    1568
#define CLCIN3PPS4                    1569
#define T3CKIPPS                      1570
#define T3GPPS                        1571
#define T5CKIPPS                      1572
#define T5GPPS                        1573
#define RA0PPS                        1574
#define RA0PPS0                       1575
#define RA0PPS1                       1576
#define RA0PPS2                       1577
#define RA0PPS3                       1578
#define RA0PPS4                       1579
#define RA1PPS                        1580
#define RA1PPS0                       1581
#define RA1PPS1                       1582
#define RA1PPS2                       1583
#define RA1PPS3                       1584
#define RA1PPS4                       1585
#define RA2PPS0                       1586
#define RA2PPS                        1587
#define RA2PPS1                       1588
#define RA2PPS2                       1589
#define RA2PPS3                       1590
#define RA2PPS4                       1591
#define RA4PPS                        1592
#define RA4PPS0                       1593
#define RA4PPS1                       1594
#define RA4PPS2                       1595
#define RA4PPS3                       1596
#define RA4PPS4                       1597
#define RA5PPS                        1598
#define RA5PPS0                       1599
#define RA5PPS1                       1600
#define RA5PPS2                       1601
#define RA5PPS3                       1602
#define RA5PPS4                       1603
#define RB4PPS                        1604
#define RB4PPS0                       1605
#define RB4PPS1                       1606
#define RB4PPS2                       1607
#define RB4PPS3                       1608
#define RB4PPS4                       1609
#define RB5PPS                        1610
#define RB5PPS0                       1611
#define RB5PPS1                       1612
#define RB5PPS2                       1613
#define RB5PPS3                       1614
#define RB5PPS4                       1615
#define RB6PPS0                       1616
#define RB6PPS                        1617
#define RB6PPS1                       1618
#define RB6PPS2                       1619
#define RB6PPS3                       1620
#define RB6PPS4                       1621
#define RB7PPS0                       1622
#define RB7PPS                        1623
#define RB7PPS1                       1624
#define RB7PPS2                       1625
#define RB7PPS3                       1626
#define RB7PPS4                       1627
#define RC0PPS                        1628
#define RC0PPS0                       1629
#define RC0PPS1                       1630
#define RC0PPS2                       1631
#define RC0PPS3                       1632
#define RC0PPS4                       1633
#define RC1PPS0                       1634
#define RC1PPS                        1635
#define RC1PPS1                       1636
#define RC1PPS2                       1637
#define RC1PPS3                       1638
#define RC1PPS4                       1639
#define RC2PPS                        1640
#define RC2PPS0                       1641
#define RC2PPS1                       1642
#define RC2PPS2                       1643
#define RC2PPS3                       1644
#define RC2PPS4                       1645
#define RC3PPS                        1646
#define RC3PPS0                       1647
#define RC3PPS1                       1648
