tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18346_tdd.h
#define RC3PPS2                       1649
#define RC3PPS3                       1650
#define RC3PPS4                       1651
#define RC4PPS0                       1652
#define RC4PPS                        1653
#define RC4PPS1                       1654
#define RC4PPS2                       1655
#define RC4PPS3                       1656
#define RC4PPS4                       1657
#define RC5PPS0                       1658
#define RC5PPS                        1659
#define RC5PPS1                       1660
#define RC5PPS2                       1661
#define RC5PPS3                       1662
#define RC5PPS4                       1663
#define RC6PPS                        1664
#define RC6PPS0                       1665
#define RC6PPS1                       1666
#define RC6PPS2                       1667
#define RC6PPS3                       1668
#define RC6PPS4                       1669
#define RC7PPS                        1670
#define RC7PPS0                       1671
#define RC7PPS1                       1672
#define RC7PPS2                       1673
#define RC7PPS3                       1674
#define RC7PPS4                       1675
#define CLCDATA                       1676
#define MLC1OUT                       1677
#define MLC2OUT                       1678
#define MLC3OUT                       1679
#define MLC4OUT                       1680
#define CLC1CON                       1681
#define CLC1CON_MODE0                 1682
#define LC1MODE                       1683
#define CLC1CON_MODE                  1684
#define LC1MODE0                      1685
#define CLC1CON_MODE1                 1686
#define LC1MODE1                      1687
#define LC1MODE2                      1688
#define CLC1CON_MODE2                 1689
#define LC1INTN                       1690
#define CLC1CON_INTN                  1691
#define CLC1CON_INTP                  1692
#define LC1INTP                       1693
#define LC1OUT                        1694
#define CLC1CON_OUT                   1695
#define CLC1CON_EN                    1696
#define LC1EN                         1697
#define CLC1POL                       1698
#define LC1G1POL                      1699
#define CLC1POL_G1POL                 1700
#define CLC1POL_G2POL                 1701
#define LC1G2POL                      1702
#define LC1G3POL                      1703
#define CLC1POL_G3POL                 1704
#define LC1G4POL                      1705
#define CLC1POL_G4POL                 1706
#define CLC1POL_POL                   1707
#define LC1POL                        1708
#define CLC1SEL0                      1709
#define CLC1SEL0_D1S0                 1710
#define LC1D1S                        1711
#define LC1D1S0                       1712
#define CLC1SEL0_D1S                  1713
#define CLC1SEL0_D1S1                 1714
#define LC1D1S1                       1715
#define CLC1SEL0_D1S2                 1716
#define LC1D1S2                       1717
#define CLC1SEL0_D1S3                 1718
#define LC1D1S3                       1719
#define CLC1SEL0_D1S4                 1720
#define LC1D1S4                       1721
#define CLC1SEL1                      1722
#define CLC1SEL1_D2S0                 1723
#define CLC1SEL1_D2S                  1724
#define LC1D2S                        1725
#define LC1D2S0                       1726
#define CLC1SEL1_D2S1                 1727
#define LC1D2S1                       1728
#define LC1D2S2                       1729
#define CLC1SEL1_D2S2                 1730
#define LC1D2S3                       1731
#define CLC1SEL1_D2S3                 1732
#define LC1D2S4                       1733
#define CLC1SEL1_D2S4                 1734
#define CLC1SEL2                      1735
#define LC1D3S0                       1736
#define CLC1SEL2_D3S                  1737
#define LC1D3S                        1738
#define CLC1SEL2_D3S0                 1739
#define LC1D3S1                       1740
#define CLC1SEL2_D3S1                 1741
#define LC1D3S2                       1742
#define CLC1SEL2_D3S2                 1743
#define LC1D3S3                       1744
#define CLC1SEL2_D3S3                 1745
#define LC1D3S4                       1746
#define CLC1SEL2_D3S4                 1747
#define CLC1SEL3                      1748
#define CLC1SEL3_D4S                  1749
#define LC1D4S                        1750
#define LC1D4S0                       1751
#define CLC1SEL3_D4S0                 1752
#define CLC1SEL3_D4S1                 1753
#define LC1D4S1                       1754
#define LC1D4S2                       1755
#define CLC1SEL3_D4S2                 1756
#define LC1D4S3                       1757
#define CLC1SEL3_D4S3                 1758
#define LC1D4S4                       1759
#define CLC1SEL3_D4S4                 1760
#define CLC1GLS0                      1761
#define CLC1GLS0_D1N                  1762
#define LC1G1D1N                      1763
#define CLC1GLS0_D1T                  1764
#define LC1G1D1T                      1765
#define LC1G1D2N                      1766
#define CLC1GLS0_D2N                  1767
#define LC1G1D2T                      1768
#define CLC1GLS0_D2T                  1769
#define CLC1GLS0_D3N                  1770
#define LC1G1D3N                      1771
#define CLC1GLS0_D3T                  1772
#define LC1G1D3T                      1773
#define CLC1GLS0_D4N                  1774
#define LC1G1D4N                      1775
#define CLC1GLS0_D4T                  1776
#define LC1G1D4T                      1777
#define CLC1GLS1                      1778
#define CLC1GLS1_D1N                  1779
#define LC1G2D1N                      1780
#define LC1G2D1T                      1781
#define CLC1GLS1_D1T                  1782
#define CLC1GLS1_D2N                  1783
#define LC1G2D2N                      1784
#define LC1G2D2T                      1785
#define CLC1GLS1_D2T                  1786
#define CLC1GLS1_D3N                  1787
#define LC1G2D3N                      1788
#define LC1G2D3T                      1789
#define CLC1GLS1_D3T                  1790
#define CLC1GLS1_D4N                  1791
#define LC1G2D4N                      1792
#define LC1G2D4T                      1793
#define CLC1GLS1_D4T                  1794
#define CLC1GLS2                      1795
#define CLC1GLS2_D1N                  1796
#define LC1G3D1N                      1797
#define LC1G3D1T                      1798
#define CLC1GLS2_D1T                  1799
#define LC1G3D2N                      1800
#define CLC1GLS2_D2N                  1801
#define LC1G3D2T                      1802
#define CLC1GLS2_D2T                  1803
#define CLC1GLS2_D3N                  1804
#define LC1G3D3N                      1805
#define LC1G3D3T                      1806
#define CLC1GLS2_D3T                  1807
#define LC1G3D4N                      1808
#define CLC1GLS2_D4N                  1809
#define LC1G3D4T                      1810
#define CLC1GLS2_D4T                  1811
#define CLC1GLS3                      1812
#define LC1G4D1N                      1813
#define CLC1GLS3_G4D1N                1814
#define LC1G4D1T                      1815
#define CLC1GLS3_G4D1T                1816
#define CLC1GLS3_G4D2N                1817
#define LC1G4D2N                      1818
#define CLC1GLS3_G4D2T                1819
#define LC1G4D2T                      1820
#define LC1G4D3N                      1821
#define CLC1GLS3_G4D3N                1822
#define LC1G4D3T                      1823
#define CLC1GLS3_G4D3T                1824
#define CLC1GLS3_G4D4N                1825
#define LC1G4D4N                      1826
#define CLC1GLS3_G4D4T                1827
#define LC1G4D4T                      1828
#define CLC2CON                       1829
#define LC2MODE0                      1830
#define CLC2CON_MODE                  1831
#define LC2MODE                       1832
#define CLC2CON_MODE0                 1833
#define LC2MODE1                      1834
#define CLC2CON_MODE1                 1835
#define LC2MODE2                      1836
#define CLC2CON_MODE2                 1837
#define LC2INTN                       1838
#define CLC2CON_INTN                  1839
#define LC2INTP                       1840
#define CLC2CON_INTP                  1841
#define CLC2CON_OUT                   1842
#define LC2OUT                        1843
#define CLC2CON_EN                    1844
#define LC2EN                         1845
#define CLC2POL                       1846
#define LC2G1POL                      1847
#define CLC2POL_G1POL                 1848
#define LC2G2POL                      1849
#define CLC2POL_G2POL                 1850
#define LC2G3POL                      1851
#define CLC2POL_G3POL                 1852
#define LC2G4POL                      1853
#define CLC2POL_G4POL                 1854
#define CLC2POL_POL                   1855
#define LC2POL                        1856
#define CLC2SEL0                      1857
#define CLC2SEL0_D1S                  1858
#define LC2D1S0                       1859
#define CLC2SEL0_D1S0                 1860
#define LC2D1S                        1861
#define LC2D1S1                       1862
#define CLC2SEL0_D1S1                 1863
#define LC2D1S2                       1864
#define CLC2SEL0_D1S2                 1865
#define CLC2SEL0_D1S3                 1866
#define LC2D1S3                       1867
#define LC2D1S4                       1868
#define CLC2SEL0_D1S4                 1869
#define CLC2SEL1                      1870
#define LC2D2S0                       1871
#define CLC2SEL1_D2S0                 1872
#define LC2D2S                        1873
#define CLC2SEL1_D2S                  1874
#define LC2D2S1                       1875
#define CLC2SEL1_D2S1                 1876
#define LC2D2S2                       1877
#define CLC2SEL1_D2S2                 1878
#define LC2D2S3                       1879
#define CLC2SEL1_D2S3                 1880
#define LC2D2S4                       1881
#define CLC2SEL1_D2S4                 1882
#define CLC2SEL2                      1883
#define CLC2SEL2_D3S                  1884
#define LC2D3S0                       1885
#define CLC2SEL2_D3S0                 1886
#define LC2D3S                        1887
#define CLC2SEL2_D3S1                 1888
#define LC2D3S1                       1889
#define LC2D3S2                       1890
#define CLC2SEL2_D3S2                 1891
#define LC2D3S3                       1892
#define CLC2SEL2_D3S3                 1893
#define LC2D3S4                       1894
#define CLC2SEL2_D3S4                 1895
#define CLC2SEL3                      1896
#define LC2D4S                        1897
#define LC2D4S0                       1898
#define CLC2SEL3_D4S                  1899
#define CLC2SEL3_D4S0                 1900
#define LC2D4S1                       1901
#define CLC2SEL3_D4S1                 1902
#define LC2D4S2                       1903
#define CLC2SEL3_D4S2                 1904
#define CLC2SEL3_D4S3                 1905
#define LC2D4S3                       1906
#define LC2D4S4                       1907
#define CLC2SEL3_D4S4                 1908
#define CLC2GLS0                      1909
#define LC2G1D1N                      1910
#define CLC2GLS0_D1N                  1911
#define CLC2GLS0_D1T                  1912
#define LC2G1D1T                      1913
#define LC2G1D2N                      1914
#define CLC2GLS0_D2N                  1915
#define CLC2GLS0_D2T                  1916
#define LC2G1D2T                      1917
#define LC2G1D3N                      1918
#define CLC2GLS0_D3N                  1919
#define CLC2GLS0_D3T                  1920
#define LC2G1D3T                      1921
#define LC2G1D4N                      1922
#define CLC2GLS0_D4N                  1923
#define CLC2GLS0_D4T                  1924
#define LC2G1D4T                      1925
#define CLC2GLS1                      1926
#define CLC2GLS1_D1N                  1927
#define LC2G2D1N                      1928
#define CLC2GLS1_D1T                  1929
#define LC2G2D1T                      1930
#define CLC2GLS1_D2N                  1931
#define LC2G2D2N                      1932
#define CLC2GLS1_D2T                  1933
#define LC2G2D2T                      1934
#define LC2G2D3N                      1935
#define CLC2GLS1_D3N                  1936
#define LC2G2D3T                      1937
#define CLC2GLS1_D3T                  1938
#define LC2G2D4N                      1939
#define CLC2GLS1_D4N                  1940
#define LC2G2D4T                      1941
#define CLC2GLS1_D4T                  1942
#define CLC2GLS2                      1943
#define LC2G3D1N                      1944
#define CLC2GLS2_D1N                  1945
#define CLC2GLS2_D1T                  1946
#define LC2G3D1T                      1947
#define CLC2GLS2_D2N                  1948
#define LC2G3D2N                      1949
#define LC2G3D2T                      1950
#define CLC2GLS2_D2T                  1951
#define CLC2GLS2_D3N                  1952
#define LC2G3D3N                      1953
#define CLC2GLS2_D3T                  1954
#define LC2G3D3T                      1955
#define CLC2GLS2_D4N                  1956
#define LC2G3D4N                      1957
#define LC2G3D4T                      1958
#define CLC2GLS2_D4T                  1959
#define CLC2GLS3                      1960
#define LC2G4D1N                      1961
#define CLC2GLS3_G4D1N                1962
#define CLC2GLS3_G4D1T                1963
#define LC2G4D1T                      1964
#define CLC2GLS3_G4D2N                1965
#define LC2G4D2N                      1966
#define LC2G4D2T                      1967
#define CLC2GLS3_G4D2T                1968
#define CLC2GLS3_G4D3N                1969
#define LC2G4D3N                      1970
#define CLC2GLS3_G4D3T                1971
#define LC2G4D3T                      1972
#define LC2G4D4N                      1973
#define CLC2GLS3_G4D4N                1974
#define CLC2GLS3_G4D4T                1975
#define LC2G4D4T                      1976
#define CLC3CON                       1977
#define LC3MODE                       1978
#define CLC3CON_MODE0                 1979
#define LC3MODE0                      1980
#define CLC3CON_MODE                  1981
#define CLC3CON_MODE1                 1982
#define LC3MODE1                      1983
#define CLC3CON_MODE2                 1984
#define LC3MODE2                      1985
#define LC3INTN                       1986
#define CLC3CON_INTN                  1987
#define LC3INTP                       1988
#define CLC3CON_INTP                  1989
#define LC3OUT                        1990
#define CLC3CON_OUT                   1991
#define LC3EN                         1992
#define CLC3CON_EN                    1993
#define CLC3POL                       1994
#define LC3G1POL                      1995
#define CLC3POL_G1POL                 1996
#define LC3G2POL                      1997
#define CLC3POL_G2POL                 1998
#define CLC3POL_G3POL                 1999
#define LC3G3POL                      2000
#define LC3G4POL                      2001
#define CLC3POL_G4POL                 2002
#define LC3POL                        2003
#define CLC3POL_POL                   2004
#define CLC3SEL0                      2005
#define CLC3SEL0_D1S0                 2006
#define LC3D1S0                       2007
#define LC3D1S                        2008
#define CLC3SEL0_D1S                  2009
#define LC3D1S1                       2010
#define CLC3SEL0_D1S1                 2011
#define LC3D1S2                       2012
#define CLC3SEL0_D1S2                 2013
#define LC3D1S3                       2014
#define CLC3SEL0_D1S3                 2015
#define LC3D1S4                       2016
#define CLC3SEL0_D1S4                 2017
#define CLC3SEL1                      2018
#define CLC3SEL1_D2S                  2019
#define CLC3SEL1_D2S0                 2020
#define LC3D2S                        2021
#define LC3D2S0                       2022
#define CLC3SEL1_D2S1                 2023
#define LC3D2S1                       2024
#define CLC3SEL1_D2S2                 2025
#define LC3D2S2                       2026
#define CLC3SEL1_D2S3                 2027
#define LC3D2S3                       2028
#define LC3D2S4                       2029
#define CLC3SEL1_D2S4                 2030
#define CLC3SEL2                      2031
#define CLC3SEL2_D3S0                 2032
#define LC3D3S                        2033
#define CLC3SEL2_D3S                  2034
#define LC3D3S0                       2035
#define LC3D3S1                       2036
#define CLC3SEL2_D3S1                 2037
#define LC3D3S2                       2038
#define CLC3SEL2_D3S2                 2039
#define LC3D3S3                       2040
#define CLC3SEL2_D3S3                 2041
#define LC3D3S4                       2042
#define CLC3SEL2_D3S4                 2043
#define CLC3SEL3                      2044
#define CLC3SEL3_D4S0                 2045
#define LC3D4S0                       2046
#define LC3D4S                        2047
#define CLC3SEL3_D4S                  2048
#define LC3D4S1                       2049
#define CLC3SEL3_D4S1                 2050
#define LC3D4S2                       2051
#define CLC3SEL3_D4S2                 2052
#define LC3D4S3                       2053
#define CLC3SEL3_D4S3                 2054
#define LC3D4S4                       2055
#define CLC3SEL3_D4S4                 2056
#define CLC3GLS0                      2057
#define CLC3GLS0_D1N                  2058
#define LC3G1D1N                      2059
#define LC3G1D1T                      2060
#define CLC3GLS0_D1T                  2061
#define LC3G1D2N                      2062
#define CLC3GLS0_D2N                  2063
#define CLC3GLS0_D2T                  2064
#define LC3G1D2T                      2065
#define CLC3GLS0_D3N                  2066
#define LC3G1D3N                      2067
#define LC3G1D3T                      2068
#define CLC3GLS0_D3T                  2069
#define CLC3GLS0_D4N                  2070
#define LC3G1D4N                      2071
#define CLC3GLS0_D4T                  2072
#define LC3G1D4T                      2073
#define CLC3GLS1                      2074
#define LC3G2D1N                      2075
#define CLC3GLS1_D1N                  2076
#define CLC3GLS1_D1T                  2077
#define LC3G2D1T                      2078
#define LC3G2D2N                      2079
#define CLC3GLS1_D2N                  2080
#define LC3G2D2T                      2081
#define CLC3GLS1_D2T                  2082
#define LC3G2D3N                      2083
#define CLC3GLS1_D3N                  2084
#define CLC3GLS1_D3T                  2085
#define LC3G2D3T                      2086
#define LC3G2D4N                      2087
#define CLC3GLS1_D4N                  2088
#define LC3G2D4T                      2089
#define CLC3GLS1_D4T                  2090
#define CLC3GLS2                      2091
#define LC3G3D1N                      2092
#define CLC3GLS2_D1N                  2093
#define LC3G3D1T                      2094
#define CLC3GLS2_D1T                  2095
#define CLC3GLS2_D2N                  2096
#define LC3G3D2N                      2097
#define CLC3GLS2_D2T                  2098
#define LC3G3D2T                      2099
#define CLC3GLS2_D3N                  2100
#define LC3G3D3N                      2101
#define LC3G3D3T                      2102
#define CLC3GLS2_D3T                  2103
#define CLC3GLS2_D4N                  2104
#define LC3G3D4N                      2105
#define CLC3GLS2_D4T                  2106
#define LC3G3D4T                      2107
#define CLC3GLS3                      2108
#define LC3G4D1N                      2109
#define CLC3GLS3_G4D1N                2110
#define LC3G4D1T                      2111
#define CLC3GLS3_G4D1T                2112
#define LC3G4D2N                      2113
#define CLC3GLS3_G4D2N                2114
#define CLC3GLS3_G4D2T                2115
#define LC3G4D2T                      2116
#define LC3G4D3N                      2117
#define CLC3GLS3_G4D3N                2118
#define CLC3GLS3_G4D3T                2119
#define LC3G4D3T                      2120
#define LC3G4D4N                      2121
#define CLC3GLS3_G4D4N                2122
#define LC3G4D4T                      2123
#define CLC3GLS3_G4D4T                2124
#define CLC4CON                       2125
#define LC4MODE                       2126
#define CLC4CON_MODE                  2127
#define LC4MODE0                      2128
#define CLC4CON_MODE0                 2129
#define LC4MODE1                      2130
#define CLC4CON_MODE1                 2131
#define LC4MODE2                      2132
#define CLC4CON_MODE2                 2133
#define LC4INTN                       2134
#define CLC4CON_INTN                  2135
#define CLC4CON_INTP                  2136
#define LC4INTP                       2137
#define CLC4CON_OUT                   2138
#define LC4OUT                        2139
#define CLC4CON_EN                    2140
#define LC4EN                         2141
#define CLC4POL                       2142
#define CLC4POL_G1POL                 2143
#define LC4G1POL                      2144
#define CLC4POL_G2POL                 2145
#define LC4G2POL                      2146
#define CLC4POL_G3POL                 2147
#define LC4G3POL                      2148
#define LC4G4POL                      2149
#define CLC4POL_G4POL                 2150
#define LC4POL                        2151
#define CLC4POL_POL                   2152
#define CLC4SEL0                      2153
#define CLC4SEL0_D1S0                 2154
#define LC4D1S0                       2155
#define CLC4SEL0_D1S                  2156
#define LC4D1S                        2157
#define CLC4SEL0_D1S1                 2158
#define LC4D1S1                       2159
#define CLC4SEL0_D1S2                 2160
#define LC4D1S2                       2161
#define CLC4SEL0_D1S3                 2162
#define LC4D1S3                       2163
#define CLC4SEL0_D1S4                 2164
#define LC4D1S4                       2165
#define CLC4SEL1                      2166
#define LC4D2S                        2167
#define LC4D2S0                       2168
#define CLC4SEL1_D2S                  2169
#define CLC4SEL1_D2S0                 2170
#define LC4D2S1                       2171
#define CLC4SEL1_D2S1                 2172
#define LC4D2S2                       2173
#define CLC4SEL1_D2S2                 2174
#define LC4D2S3                       2175
#define CLC4SEL1_D2S3                 2176
#define LC4D2S4                       2177
#define CLC4SEL1_D2S4                 2178
#define CLC4SEL2                      2179
#define LC4D3S                        2180
#define CLC4SEL2_D3S                  2181
#define CLC4SEL2_D3S0                 2182
#define LC4D3S0                       2183
#define LC4D3S1                       2184
#define CLC4SEL2_D3S1                 2185
#define CLC4SEL2_D3S2                 2186
#define LC4D3S2                       2187
#define CLC4SEL2_D3S3                 2188
#define LC4D3S3                       2189
#define LC4D3S4                       2190
#define CLC4SEL2_D3S4                 2191
#define CLC4SEL3                      2192
#define LC4D4S0                       2193
#define LC4D4S                        2194
#define CLC4SEL3_D4S0                 2195
#define CLC4SEL3_D4S                  2196
#define LC4D4S1                       2197
#define CLC4SEL3_D4S1                 2198
#define LC4D4S2                       2199
#define CLC4SEL3_D4S2                 2200
#define LC4D4S3                       2201
#define CLC4SEL3_D4S3                 2202
#define LC4D4S4                       2203
#define CLC4SEL3_D4S4                 2204
#define CLC4GLS0                      2205
#define CLC4GLS0_D1N                  2206
