tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18346_tdd.h
#define LC4G1D1N                      2207
#define CLC4GLS0_D1T                  2208
#define LC4G1D1T                      2209
#define CLC4GLS0_D2N                  2210
#define LC4G1D2N                      2211
#define CLC4GLS0_D2T                  2212
#define LC4G1D2T                      2213
#define CLC4GLS0_D3N                  2214
#define LC4G1D3N                      2215
#define CLC4GLS0_D3T                  2216
#define LC4G1D3T                      2217
#define CLC4GLS0_D4N                  2218
#define LC4G1D4N                      2219
#define CLC4GLS0_D4T                  2220
#define LC4G1D4T                      2221
#define CLC4GLS1                      2222
#define CLC4GLS1_D1N                  2223
#define LC4G2D1N                      2224
#define CLC4GLS1_D1T                  2225
#define LC4G2D1T                      2226
#define LC4G2D2N                      2227
#define CLC4GLS1_D2N                  2228
#define LC4G2D2T                      2229
#define CLC4GLS1_D2T                  2230
#define CLC4GLS1_D3N                  2231
#define LC4G2D3N                      2232
#define LC4G2D3T                      2233
#define CLC4GLS1_D3T                  2234
#define CLC4GLS1_D4N                  2235
#define LC4G2D4N                      2236
#define CLC4GLS1_D4T                  2237
#define LC4G2D4T                      2238
#define CLC4GLS2                      2239
#define CLC4GLS2_D1N                  2240
#define LC4G3D1N                      2241
#define CLC4GLS2_D1T                  2242
#define LC4G3D1T                      2243
#define LC4G3D2N                      2244
#define CLC4GLS2_D2N                  2245
#define LC4G3D2T                      2246
#define CLC4GLS2_D2T                  2247
#define CLC4GLS2_D3N                  2248
#define LC4G3D3N                      2249
#define CLC4GLS2_D3T                  2250
#define LC4G3D3T                      2251
#define LC4G3D4N                      2252
#define CLC4GLS2_D4N                  2253
#define LC4G3D4T                      2254
#define CLC4GLS2_D4T                  2255
#define CLC4GLS3                      2256
#define CLC4GLS3_G4D1N                2257
#define LC4G4D1N                      2258
#define LC4G4D1T                      2259
#define CLC4GLS3_G4D1T                2260
#define LC4G4D2N                      2261
#define CLC4GLS3_G4D2N                2262
#define LC4G4D2T                      2263
#define CLC4GLS3_G4D2T                2264
#define CLC4GLS3_G4D3N                2265
#define LC4G4D3N                      2266
#define CLC4GLS3_G4D3T                2267
#define LC4G4D3T                      2268
#define LC4G4D4N                      2269
#define CLC4GLS3_G4D4N                2270
#define LC4G4D4T                      2271
#define CLC4GLS3_G4D4T                2272
#define STATUS_SHAD                   2273
#define C_SHAD                        2274
#define DC_SHAD                       2275
#define Z_SHAD                        2276
#define WREG_SHAD                     2277
#define BSR_SHAD                      2278
#define PCLATH_SHAD                   2279
#define FSR0L_SHAD                    2280
#define FSR0H_SHAD                    2281
#define FSR1L_SHAD                    2282
#define FSR1H_SHAD                    2283
#define STKPTR                        2284
#define TOSL                          2285
#define TOSH                          2286

#endif // _PIC16F18346_H_
